app/views/devise/registrations/edit.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 1
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
        <div class="row">
          <p align="left"><% if current_user.recipes.count < 3 %><font color="red"> MESSAGES:</font>

SELECT COUNT(*) FROM "batches" WHERE "batches"."user_id" = ?  [["user_id", 1]]
---
                <a href="/recipes" class="list-group-item">Number of recipes you've uploaded: <span class="badge"><%= current_user.recipes.count %></span></a>
                <a href="/batches" class="list-group-item">Number of batches you've created: <span class="badge"><%= current_user.batches.count %></span></a>