app/views/recipes/index.html.erb

    Your Recipes
    <h5>You've added <font coler="red"><%= current_user.recipes.count %> recipe(s) </font>. Are you ready to add some more?</h5>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]