app/views/styles/index.html.erb

  <h5>
    The BJCP style guidelines currently recognize <%= Style.count %> different, distinct, individual and judgeable styles of beer (ales and lagers). Check out the flavor profiles of some of the more popular and widely distributed brands we've included here.  Brewers, use this as your inspiration when planning the 'perfect' recipe.
  </h5>
---
SELECT COUNT(*) FROM "styles"