app/views/devise/sessions/new.html.erb

            </a>
            <a href="#" class="list-group-item">Members <span class="badge"><%= User.count %></span></a>
            <a href="#" class="list-group-item">Recipes Uploaded <span class="badge"><%= Recipe.count %></span></a>
            <a href="#" class="list-group-item">Batches Made<span class="badge"><%= Batch.count %></span></a>
            <h3><i>Most Popular Recipe Styles</i></h3>
            <a href="#" class="list-group-item">American Stout Recipes <span class="badge"><%= Recipe.where({ :style_id => "1" }).count %></span></a>
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "recipes"
SELECT COUNT(*) FROM "batches"
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."style_id" = ?  [["style_id", 1]]

            <h3><i>Popular Recipe Types</i></h3>
            <a href="#" class="list-group-item">All Grain Recipes<span class="badge"><%= Recipe.where({ :brew_type => "All-Grain!"}).count %></span></a>
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."brew_type" = ?  [["brew_type", "All-Grain!"]]