app/views/batches/show.html.erb

SELECT "unis".* FROM "unis" WHERE "unis"."batch_id" = ?  [["batch_id", 1]]
SELECT COUNT(*) FROM "unis" WHERE "unis"."batch_id" = ?  [["batch_id", 1]]
---
        <hr>
        <h6 align="center">You've generated</h6><h3 align="center"><font color="red"><%= @batch.unis.count %></font></h3><h6>IDs so far for this batch. You've got <%= 24.to_i - @batch.unis.count %> left.</h6>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."batch_id" = ?  [["batch_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."batch_id" = ?  [["batch_id", 1]]
---
      <div class="panel-heading">
        <h3 class="panel-title"><%= @batch.reviews.count %> Review(s)</h3>