app/controllers/styles_controller.rb

    def set_style
      @style = Style.find(params[:id])
---
SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", 17]]